OpenDTEF-v1812/tutorials/incompressible/icoFoam/cavityMappingTest/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication -s coarseMesh blockMesh -dict system/blockMeshDict.coarse

mkdir constant/coarseMesh
mv constant/polyMesh constant/coarseMesh

runApplication -s fine blockMesh -dict system/blockMeshDict.fine

runApplication $(getApplication)

#------------------------------------------------------------------------------
